{"config": {"name": "sequential_1", "layers": [{"config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_constraint": null, "filters": 32, "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "batch_input_shape": [null, 20, 20, 3], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_size": [5, 5], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 64, "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_size": [5, 5], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "name": "dense_1", "units": 256}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "name": "dense_2", "units": 128}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "softmax", "name": "dense_3", "units": 34}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}