{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"activation": "relu", "batch_input_shape": [null, 20, 20, 3], "bias_constraint": null, "dtype": "float32", "data_format": "channels_last", "kernel_size": [5, 5], "trainable": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_1", "filters": 32, "kernel_regularizer": null, "padding": "same", "use_bias": true, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "filters": 64, "kernel_size": [5, 5], "padding": "same", "use_bias": true, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "units": 256, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "units": 128, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "units": 34, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_1"}, "class_name": "Sequential"}